{
  "contact": {
    "name": "Peter Correa",
    "title": "Software Engineer",
    "email": "contact@petercorrea.com",
    "mailto": "mailto:contact@petercorrea.com?subject=PeterCorrea.com:%20reaching%20out...",
    "linkedin": "https://www.linkedin.com/in/petercorrea",
    "github": "https://www.github.com/petercorrea",
    "website": "https://www.petercorrea.com",
    "youtube": "https://www.youtube.com/@petercorrea"
  },
  "professionalSummary": [
    "I've worked on a range of notable projects, from in-house billing services and vendor marketplaces to personalization platforms. My work spans mobile apps for a few hundred users to web apps that reach several million across the globe. I've built software for a variety of organizations including a waste management start-up, and at an agency where I worked with major clients like PayPal and Coinbase.",
    "My day-to-day responsibilities normally include deploying full-stack applications, migrating databases, improving developer experiences, writing test cases, and integrating APIs. When I'm not coding, I'm collaborating with designers and stakeholders, presenting to staff, conducting code reviews, interviewing candidates, mentoring peers, and onboarding new team members.",
    "Beyond general software engineering, I occasionally explore areas like cryptography, game theory, embedded systems, machine learning and playing the saxophone."
  ],
  "professionalExperience": [
    {
      "company": "Shift4",
      "date": "2024 –– present",
      "role": "Software Engineer",
      "responsibilities": [
        "Shift4 is a global company focused on building a powerful POS (point of sales) system. My team focuses on the merchant facing portal where businesses can setup, operate and manage their payments, menus, orders, storefronts, integrations and more. "
      ],
      "skills": [
        "Ember.JS",
        "RabbitMQ",
        "Redis",
        "Docker",
        "Postgres",
        "Node.js",
        "Sentry.io",
        "GitLab"
      ]
    },
    {
      "company": "RoadRunner",
      "date": "2022 –– 2023",
      "role": "Software Engineer",
      "responsibilities": [
        "At RoadRunner I was hired to support the billing and invoicing systems. This involved working on a Ruby on Rails application with a React frontend. As a Full Stack Engineer, common tasks included editing database schemas, designing models, updating controllers, creating view components, adding new workflows and writing test cases. Notable projects include overhauling the invoice pages which improved operations for the product and data analytics team; containerizing the development process to improve DX and expedite onboarding; and enhancing billing capabilities for our customers which improved our ability to bill accurately. When I wasn't writing code I focused on reviewing code, onboarding team members, interviewing candidates, presenting to staff, and improving internal processes."
      ],
      "skills": ["TypeScript", "React", "Ruby on Rails", "Postgres", "Node.js"]
    },
    {
      "company": "PayPal",
      "date": "2021 –– 2022",
      "role": "Software Engineer",
      "responsibilities": [
        "At PayPal I was contracted as a Backend Engineer to work with their API Gateway team. We were tasked with building out a GraphQL API for several services to consume. This involved integrating with mobile clients, personalization services, marketplaces and third-party systems. Notable projects include writing custom image parsing algorithms for dynamic theming, integrating systems from acquisitions (HoneyDeals), improving the internal content management system, and collaborating with the folks at Apollo to share use cases, experiment with early features and improve the product."
      ],
      "skills": ["TypeScript", "GraphQL", "Node.js"]
    },
    {
      "company": "Coinbase",
      "date": "2020 –– 2021",
      "role": "Software Engineer",
      "responsibilities": [
        "After pivoting from retail operations to tech, I was contracted by Coinbase as a Frontend Engineer to work on public facing corporate pages. This involved working closely with the legal team to ensure compliance in multiple financial regulatory regions, and with the data science team to accurately capture and improve telemetry."
      ],
      "skills": [
        "TypeScript",
        "GraphQL",
        "Node.js",
        "Contently",
        "Storybook",
        "Jest"
      ]
    },
    {
      "company": "Target",
      "date": "2014 –– 2019",
      "role": "Manager",
      "responsibilities": [
        "Shortly after graduating, I was hired at Target as a manager. I had assignments in sales and assets protection. My responsibilities were wide as they included managing a $75M+ operation, improving profitability, enhancing operations, reducing liabilities, conducting internal investigations of theft and fraud, and ensuring safety and cultural satisfaction. Notable projects included executing new technological initiatives such as flexible fulfillment (online store), curbside pickup, RFID logistics, online pickup, same day delivery (Shipt) and designer collaborations. I was responsible for a team of 50+ with 6 direct reports. Two of my proudest achievements were being selected for their advance leadership accelerator (L.E.A.D.) and ranking the highest in internal cultural satisfaction (Best Team Survey)."
      ],
      "skills": ["Management", "Operations", "Analytics", "Asset Protection"]
    },
    {
      "company": "Apple",
      "date": "2011–– 2012",
      "role": "Technical Specialist",
      "responsibilities": [
        "While in college, I worked at the Apple Store as a Family Room Specialist where I triaged software and hardware issues for our guests. I performed hardware tests, conducted repairs, upgraded hardware, performed data recovery and transfers, and facilitated training."
      ],
      "skills": [
        "Hardware Repairs",
        "Software Recovery",
        "Customer Service",
        "Sales",
        "Technical Support",
        "Educating"
      ]
    }
  ],
  "academicExperience": [
    {
      "company": "Florida International University - Dept. of Biology",
      "date": "2012 - 2014",
      "role": "Student Teaching Assistant",
      "responsibilities": [
        "Lectured undergraduate pre-med students on Biology I & II",
        "Administered testing and practice active learning pedagogies",
        "Planned, built, and presented a curriculum covering topics in physics, biology, and chemistry",
        "Collaborated with staff and faculty to assess and improve student engagement and performance"
      ],
      "skills": []
    },
    {
      "company": "Apple Store",
      "date": "2010 - 2012",
      "role": "Software & Hardware Specialist",
      "responsibilities": [
        "Triaged software and hardware issues on phones, tablets, desktops, and laptops",
        "Performed testing and analysis of critical electrical components and device modules",
        "Managed technical appointments and traffic, engaged both customers and teams to increase throughput",
        "Performed and audited technical repairs, hardware upgrades, and data recovery and migrations",
        "Trained and developed peers and new employees"
      ],
      "skills": []
    }
  ],
  "education": [
    {
      "school": "University of Colorado, Boulder",
      "degree": "Master of Science",
      "study": "Electrical Engineering",
      "graduationDate": "2025"
    },
    {
      "school": "Florida International University",
      "degree": "Bachelor of Arts",
      "study": "Liberal Studies & Biology",
      "graduationDate": "2014"
    }
  ],
  "skills": [
    "JavaScript",
    "TypeScript",
    "Python",
    "Go",
    "Rust",
    "C",
    "C++",
    "HTML",
    "CSS",
    "Node.js",
    "GraphQL",
    "React.js",
    "Next.js",
    "Solid.js",
    "SQL",
    "PostgreSQL",
    "MongoDB",
    "Redis",
    "Kafka",
    "Docker",
    "Kubernetes",
    "Vercel",
    "Heroku",
    "AWS",
    "Amazon Web Services",
    "Datadog",
    "Contently",
    "Strapi",
    "CodeFlow",
    "Jenkins",
    "Jest",
    "SonarCloud",
    "Code Climate",
    "Optimizely",
    "Git",
    "CI/CD",
    "Object-Oriented",
    "Unit Testing",
    "Integration Testing"
  ],
  "certificates": [
    {
      "organization": "Thinkful",
      "certificate": "Software Engineering Bootcamp",
      "year": "2019"
    },
    {
      "organization": "DataCamp",
      "certificate": "Data Scientist Track with Python",
      "year": "2018"
    }
  ],
  "projects": [
    {
      "type": "app",
      "title": "Spotify Clone",
      "description": "A rendition of the popular Spotify service. Upload music, create your own library and share it with others.",
      "github_url": "https://github.com/petercorrea/spotify-clone",
      "youtube_url": "",
      "production_url": "https://spotify-clone-nu-virid.vercel.app/",
      "general_url": "",
      "tags": [
        "React",
        "Next.js",
        "Supabase",
        "Postgres",
        "Stripe",
        "Vercel",
        "Tailwind"
      ],
      "image": "/projects/spotify.png",
      "features": [
        "Built with Next.js and deployed on Vercel",
        "Integrated with Supabase and Stripe",
        "Sign in with email or Github",
        "Upload, search, and listen to music",
        "Find music uploaded by others"
      ]
    },
    {
      "type": "video",
      "title": "Linked Lists",
      "description": "Learn what Linked Lists are, and follow along as we implement one together.",
      "github_url": "",
      "youtube_url": "https://youtu.be/nkzHzvvSdcE",
      "production_url": "",
      "general_url": "",
      "tags": ["Data Structures", "JavaScript"],
      "image": "/projects/linkedlists.png",
      "features": []
    },
    {
      "type": "video",
      "title": "The JS Runtime Engine",
      "description": "A high level overview of the event loop and task queues powering the JS engine.",
      "github_url": "",
      "youtube_url": "https://youtu.be/9uAosfffLKc",
      "production_url": "",
      "general_url": "",
      "tags": ["JavaScript"],
      "image": "/projects/engine.png",
      "features": []
    },
    {
      "type": "video",
      "title": "OOP in JS",
      "description": "A review of some of the most popular design patterns, prototypal inheritance and object oriented programming in JS.",
      "github_url": "",
      "youtube_url": "https://youtu.be/x1kp0y_-zp8",
      "production_url": "",
      "general_url": "",
      "tags": ["JavaScript", "OOP"],
      "image": "/projects/oop.png",
      "features": []
    },
    {
      "type": "article",
      "title": "Saxophone, Berklee, & Code",
      "description": "An written interview about me and my journey from music to tech.",
      "github_url": "",
      "youtube_url": "",
      "production_url": "",
      "general_url": "https://x-team.com/blog/interview-peter-correa/",
      "tags": ["Interview"],
      "image": "/projects/sax.jpg",
      "features": []
    },
    {
      "type": "video",
      "title": "The Thinkful Experience",
      "description": "An online interview of my bootcamp experience at Thinkful.",
      "github_url": "",
      "youtube_url": "https://youtu.be/BKSnLuXu_dc",
      "production_url": "",
      "general_url": "",
      "tags": ["Interview", "Bootcamps"],
      "image": "/projects/thinkful.png",
      "features": []
    }
  ]
}
